In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({ 'Sütun A': [1, np.nan, 30, np.nan], 'Sütun B': [2, 8, 31, np.nan], 'Sütun C': [np.nan, 9, 32, 100], 'Sütun D': [5, 8, 34, 110], })

In [3]:
df

   Sütun A  Sütun B  Sütun C  Sütun D
0      1.0      2.0      NaN        5
1      NaN      8.0      9.0        8
2     30.0     31.0     32.0       34
3      NaN      NaN    100.0      110

In [4]:
df.dropna()

   Sütun A  Sütun B  Sütun C  Sütun D
2     30.0     31.0     32.0       34

In [5]:
df.dropna(axis=1)

   Sütun D
0        5
1        8
2       34
3      110

In [13]:
df2 = pd.DataFrame({
'Sütun A': [1, np.nan, 30], 'Sütun B': [2, np.nan, 31], 'Sütun C': [np.nan, np.nan, 100] })

In [7]:
df2

   Sütun A  Sütun B  Sütun C
0      1.0      2.0      NaN
1      NaN      NaN      NaN
2     30.0     31.0    100.0

In [8]:
df2.dropna(how="all")

   Sütun A  Sütun B  Sütun C
0      1.0      2.0      NaN
2     30.0     31.0    100.0

In [12]:
df2.fillna(0) #null değerleri 0'la doldur ffill: önceki değerle doldur bfill: sonraki değerle doldur

   Sütun A  Sütun B  Sütun C
0      1.0      2.0      0.0
1      0.0      0.0      0.0
2     30.0     31.0    100.0

In [14]:
df2.fillna(df2.mean()) #null değerleri serinin ortalamasıyla doldur

   Sütun A  Sütun B  Sütun C
0      1.0      2.0    100.0
1     15.5     16.5    100.0
2     30.0     31.0    100.0